Revit 2027 API
ParameterTypeId.TrussFamilyTopChordStructuralTypesParam Property
 "Structural Framing Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TrussFamilyTopChordStructuralTypesParam { get; }
Public Shared ReadOnly Property TrussFamilyTopChordStructuralTypesParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TrussFamilyTopChordStructuralTypesParam {
	ForgeTypeId^ get ();
}
static member TrussFamilyTopChordStructuralTypesParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace